W8D1/redditclone_project/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wXwuCimP4ce3CwDmq8LxmACq78cWEfugvfNzsFNW/kGDObKbFMky/27nQSeW3uV2vX7EbCrl0lgfqQSVNaeWMQ=="], ["updated_at", "2020-03-30 23:14:22.922860"], ["id", 5]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!