W7D2/music_project/app/controllers/bands_controller.rb

    def create
        band = Band.create(new_band_params)
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "plo"], ["created_at", "2020-03-25 23:15:12.132152"], ["updated_at", "2020-03-25 23:15:12.132152"]]

    def update
        @band = Band.find(params[:id])
        if @band.update_attributes(new_band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "ja rule"], ["updated_at", "2020-03-25 23:56:26.330631"], ["id", 2]]